[
  {
    "id": 1,
    "name": "Abdallah Shapsough",
    "headline": "VP Product & Professional Services",
    "relationship": "Worked with Sherif on different teams",
    "date": "2025-04-30",
    "quote": "I learned so much from Sherif during his time as Head of Product at Pelcro. He’s a visionary with the rare ability to both inspire and execute. A great communicator who can rally teams and clients alike, Sherif consistently delivered impact and clarity. Any team would be lucky to have him.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 2,
    "name": "Rana Haleem",
    "headline": "Software Engineer / Product Manager",
    "relationship": "Reported directly to Sherif",
    "date": "2024-10-22",
    "quote": "Sherif is one of the hardest workers I know, always paying attention to the details and making sure everything gets done. It’s impressive how dedicated he is—he often won’t rest until the job is finished! On top of that, he’s super supportive and always there for his team. His compassion and work ethic really stand out, and it’s genuinely a pleasure to work with him.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 3,
    "name": "Ayman Adel",
    "headline": "Senior Quality Assurance Engineer at Pelcro",
    "relationship": "Worked with Sherif on the same team",
    "date": "2024-10-10",
    "quote": "If there’s one person who brings both precision and passion to every project, it’s Sherif. Working with him was a lesson in how attention to detail and deadlines can be perfectly balanced (sometimes with a little fiery determination). Sure, he might be a bit hot-headed when things aren’t perfect, but that’s only because he genuinely cares about delivering the best possible outcome. Sherif’s ability to organize, care for his team, and chase perfection is inspiring—and a little intimidating in the best way! If you want a project done with heart and excellence, Sherif’s your guy.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 4,
    "name": "Michael Ghattas",
    "headline": "Pelcro CEO, Billing for Publishers & Media",
    "relationship": "Managed Sherif directly",
    "date": "2024-10-10",
    "quote": "It's been an absolutely pleasure working with Sherif at Pelcro. He took extreme ownership over his role, and leveraged his excellent communication to manage the team and client problems effectively. Sherif has always worked with a high degree of discipline, integrity and always took it upon himself to solve the hardest problems.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 5,
    "name": "Shobhi Kandasamy",
    "headline": "Associate Director",
    "relationship": "Sherif’s client",
    "date": "2024-10-09",
    "quote": "Working with Sherif as Oxford American transitioned its subscription management in-house with Pelcro has been a privilege. His thoughtful and thorough approach has brought significant benefits to our organization. Sherif consistently demonstrates industry knowledge and a sharp ability to navigate and resolve complex challenges, ensuring that our product needs are met with high standards. I highly recommend Sherif for his professionalism and unparalleled expertise in driving product success.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 6,
    "name": "Mike Gilbert",
    "headline": "Systems Developer",
    "relationship": "Sherif’s client",
    "date": "2024-10-09",
    "quote": "I worked with Sherif while my organization migrated to a new subscription system. He was critical to the success of the project: always answering our questions and making sure the product could do what we needed it to do.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 7,
    "name": "Jeff Spies",
    "headline": "Subscription Management Expert | Product, Project, Marketing & Operations Leadership",
    "relationship": "Sherif’s client",
    "date": "2024-10-02",
    "quote": "Over the past eighteen months, I have had the pleasure of working with Sherif on several high impact feature requests, as he built out his product roadmap. Sherif was a joy to work with, as I could count on him to challenge my preconceptions and deliver quality solutions to my company's problems. Sherif can disagree without being disagreeable, and I have always found him to be open to new ideas, transparent, and willing to work hard to deliver what he's promised. Sherif has always been willing to roll up his sleeves and join me in the weeds as we researched root causes and potential fixes. He is very skilled at documenting SOWs, BRDs, and technical specs so that stakeholders of varying degrees of technical acumen could clearly understand his solutions. I will miss our weekly chats and Slack conversations. All the best Sherif! I hope we can work together again someday.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 8,
    "name": "Ahmed Mohsen",
    "headline": "Senior Software Engineer @ Benjamin",
    "relationship": "Worked with Sherif on different teams",
    "date": "2024-10-01",
    "quote": "I had the pleasure of working alongside Sherif at Pelcro, and I was consistently impressed by his ability to drive product vision and execute with precision. Sherif's deep understanding of the product lifecycle, from gathering user requirements to launching features, was evident in how smoothly our product progressed. As a software developer, collaborating with him was always efficient, thanks to his clear communication and problem-solving skills, which allowed us to plan and execute with ease. He also possesses a unique ability to balance business needs with the voice of the customer, ensuring his product decisions are both strategic and user-focused. Anyone who has the opportunity to work with Sherif will undoubtedly benefit from his expertise, leadership, and dedication to delivering high-quality products.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 9,
    "name": "Mohamed Ali",
    "headline": "Principal Software Engineer at Pelcro",
    "relationship": "Worked with Sherif on the same team",
    "date": "2024-09-30",
    "quote": "Sherif is a highly dedicated and reliable individual who has consistently demonstrated exceptional performance in his role. His unwavering commitment to his work, coupled with strong interpersonal skills and keen attention to detail, has made him an invaluable asset to our team. He is adept at identifying and resolving complex challenges. His ability to think critically and develop effective solutions is a valuable asset to any team. I wholeheartedly recommend Sherif for any role that requires a dedicated, hardworking, and compassionate individual.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 10,
    "name": "Farida El Bakry",
    "headline": "Board Member at ValueTech | Marketing Strategist at FranklinCovey Egypt",
    "relationship": "Reported directly to Sherif",
    "date": "2023-05-08",
    "quote": "Sherif has an incredible capability of being able to push you while also maintaining your motivation and urge to improve. I had the pleasure of working with Sherif as a product marketer, in which I gained more insight into the product and also developed skills that are usable in any work I decide to venture on. His timeliness on task delivery, organization skills, and capability of being able to simplify complex problems eloquently and efficiently is truly what sets him apart from others in his field. This, paired with his sunny disposition and growing appetite for knowledge, made my experience with him all the better.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 11,
    "name": "Frédéric Trudeau",
    "headline": "Vice President of Engineering at Pelcro",
    "relationship": "Worked with Sherif on the same team",
    "date": "2023-03-03",
    "quote": "Sherif's capacity to remain organized and involved in multiple concurrent complex projects has made him a dependable key team member at Pelcro. His capacity to work under stress and his handling of tough situations is second to none. I had the pleasure to work closely with him multiple times, and I look forward for this trend to continue.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 12,
    "name": "Ibrahim Zaghw",
    "headline": "CEO and Founder of 11:07",
    "relationship": "Worked with Sherif on different teams",
    "date": "2023-03-01",
    "quote": "I had the pleasure of working with Sherif while we were both at Zyda, and throughout that time, I was blown away by both his communication skills and his ability to see the bigger picture. He is an excellent diplomat, capable of handling the hardest and least cooperative of individuals. Yet, simultaneously, he never loses sight of the business context surrounding each task he performs, making sure that he has not only identified the right problem but is also tackling it in the best way he knows how. And, to top it all off, Sherif’s aesthetic sensibilities and his understanding of user behavior shone clearly every time the team grappled with user experience.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 13,
    "name": "Alex Barreto",
    "headline": "General Manager @ Stealth Startup | Product Strategy, Growth",
    "relationship": "Managed Sherif directly",
    "date": "2023-03-01",
    "quote": "Working with Sherif was a pleasure. He is a natural product manager and always thinks of new approaches to improve our product. He always has the best recommendations for books and podcasts. His communication skills are top-notch, and he is extremely driven to get things done despite obstacles. Sherif would be a great addition to any product team.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 14,
    "name": "Marwan Tawakol",
    "headline": "Senior Test Engineer, Quality Assurance",
    "relationship": "Worked with Sherif on the same team",
    "date": "2023-02-27",
    "quote": "As a QA, life was easier when it came to reviewing the requirements and user stories for each feature we were working on, especially with Sherif's amazing interpersonal skills and his patience. He had no problem jumping on a call to review stories and requirements again, explaining them clearly to make sure the released feature had no downside. Working in huge projects with him is more like a picnic.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 15,
    "name": "Sara Rady",
    "headline": "Sales Manager",
    "relationship": "Worked with Sherif on the same team",
    "date": "2022-07-05",
    "quote": "Sherif and I worked together on several projects. He consistently gave 100 percent effort to the team and played a significant role in ensuring that we deliver projects on time. He had excellent time management skills and had a knack for keeping everyone calm and productive during intense periods.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 16,
    "name": "Aya Elsawi",
    "headline": "Product Design @ Jisr",
    "relationship": "Worked with Sherif on the same team",
    "date": "2022-05-15",
    "quote": "Sherif is a great product manager and someone to count on. He's very helpful, thoughtful and fun to work with. He's flexible and responsive to new ideas that could really help and leave a great impact on the team and product. He was always willing to go the extra mile to make everyone comfortable and lift the stress off the team. It was a pleasure working with him; he is a great asset to any team with his dedication and expertise.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 17,
    "name": "Noha AbdAlla",
    "headline": "Product Manager",
    "relationship": "Worked with Sherif on different teams",
    "date": "2022-05-15",
    "quote": "I worked with Sherif at Dell for around two years; he was a very skilled resource deployment manager with excellent people and communication skills. As part of the PM team who worked on a daily basis with Sherif and his team, Sherif was our go-to person for anything urgent that needed quick action. The amount of support he provided was amazing and he was a delight to work with.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 18,
    "name": "Amr Ismail",
    "headline": "Product Manager at Yassir",
    "relationship": "Sherif was senior to Amr (not direct manager)",
    "date": "2022-05-15",
    "quote": "Sherif has been, and still is, a crucial factor to my success at Zyda. I joined as an Associate Product Manager after a long career in Training & Development and needed a lot of mentoring to speed up my learning curve. Not only did Sherif facilitate this journey, he also made sure I learned the tiniest details of the PM's job to accelerate my time-to-proficiency. He's highly influential and motivates you to follow his work ethic without even trying. I'd highly recommend him to any company or role.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 19,
    "name": "Cássia Ferreira",
    "headline": "Sales Account Executive (MBA Marketing & Strategic Sales)",
    "relationship": "Worked with Sherif on different teams",
    "date": "2022-05-15",
    "quote": "I had the pleasure of working with Sherif in a couple of projects that involved growth and product. I was amazed by his creativity and his mindset to create solutions. He’s an amazing and inspiring person, and working with him is a guarantee of fun.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 20,
    "name": "Khaled Albarawy",
    "headline": "Software Engineer @ Adyen",
    "relationship": "Worked with Sherif on the same team",
    "date": "2022-04-20",
    "quote": "Sherif is the perfect product manager. He's trustworthy, creative, has a long-term vision, and is fun to work with. He helped improve the product in many ways and is always helpful and open to ideas. He has a combination of humor and empathy that lifts the spirit in stressful situations. I highly recommend Sherif to any organization.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 21,
    "name": "Ahmed Al Mansour, ITIL, PMP, MSP",
    "headline": "District Program Delivery Manager at Dell Technologies",
    "relationship": "Worked with Sherif on the same team",
    "date": "2021-09-15",
    "quote": "Sherif is a true inspiration to me and to the rest of the team. He understands the 80/20 rule and lives it daily, recognizing issues and potential concerns before they occur and mitigating their effects. He is highly motivated, proactive, responsible and committed, always exceeding expectations. I enjoy working with Sherif as a super-qualified and talented PM/RM across all aspects.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 22,
    "name": "Ashley King",
    "headline": "Information Security | Risk Management | Program & Project Management",
    "relationship": "Worked with Sherif on the same team",
    "date": "2021-04-17",
    "quote": "Sherif is an excellent project manager and a joy to work with. He is incredibly dependable, goes out of his way to help team members, happily takes on new tasks, and proactively thinks up innovative ideas for improving processes. He has a unique talent for easily building relationships through his charismatic personality, giving him a strong edge with both internal and external stakeholder engagement.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 23,
    "name": "Paola Ortiz",
    "headline": "Director of Project Management and Information Systems Auditor",
    "relationship": "Managed Sherif directly",
    "date": "2021-03-08",
    "quote": "Sherif is an excellent professional. In the time we worked together I felt that I could count on him for anything and everything. He is a quick learner and impressed me most with his ability to learn from mistakes and to always look for ways to improve processes, making the team's life easier. As a person, Sherif is trustworthy, professional, cheerful, respectful and very responsible.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 24,
    "name": "Kellie du Preez",
    "headline": "DPO via VeraSafe",
    "relationship": "Senior to Sherif (not direct manager)",
    "date": "2021-02-02",
    "quote": "Sherif is a pleasure to work with—a perfect combination of helpful, thoughtful, creative, dedicated, and funny. He's been a wonderful project manager for our team, keeping several complex privacy and security compliance projects on track. He took it upon himself to learn more about privacy-by-design principles to suggest improvements for clients and business ideas for our company.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 25,
    "name": "Jean van Wyk",
    "headline": "Group Data Privacy and Protection Specialist at FirstRand | Attorney | CIPP/E | CIPM | FIP",
    "relationship": "Worked with Sherif on the same team",
    "date": "2021-01-21",
    "quote": "It's always a pleasure working alongside Sherif on a project. He excels at the core elements of his job and on tasks that extend well beyond the scope of his role. Sherif's productivity and ambition set a great example for the rest of the team. If you're looking for a killer project manager, look no further than Sherif Kamal!",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 26,
    "name": "Zia Maharaj",
    "headline": "Partner at VeraSafe | CIPP/E | CIPP/US | CIPM | FIP",
    "relationship": "Worked with Sherif on the same team",
    "date": "2021-01-19",
    "quote": "As an attorney, I once believed it could be challenging to work with individuals who have completely different qualifications, as we tend to speak different languages. Sherif eliminated this misconception from day one. He excels at his own functions while making my role easy and seamless. He has excellent written and verbal communication skills, foresight to identify possible problems and propose solutions, and manages upwards and downwards in a tactful manner. He is a great asset to my team and an absolute pleasure to work with!",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 27,
    "name": "Chris Gaffney",
    "headline": "System Administrator and Integrator at VeraSafe",
    "relationship": "Worked with Sherif on the same team",
    "date": "2021-01-18",
    "quote": "I worked extensively with Sherif at VeraSafe. In his role as Project Manager he assisted me in the IT department by prioritizing tasks and ensuring the timely completion of tasks and projects. With the increasing demands in a rapidly growing company he did an extraordinary job. His background in IT and technical skills were a great asset to ensure the smooth functioning of the department.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 28,
    "name": "Calli Schroeder",
    "headline": "Senior Counsel and Global Privacy Counsel at EPIC",
    "relationship": "Worked with Sherif on different teams",
    "date": "2020-07-10",
    "quote": "Sherif works with me directly as the Project Manager for several client projects. He has been unfailingly organized, communicative, and supportive of all team members. His background knowledge of data protection and IT has proven invaluable, as has his willingness to step in and assist wherever needed. His value as a coworker cannot be overstated.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 29,
    "name": "Nick Maystrenko",
    "headline": "Resource Management @ FTI Consulting | Change Management | Business Operations",
    "relationship": "Worked with Sherif on the same team",
    "date": "2019-10-15",
    "quote": "Working with Sherif is always a pleasure. He is a good listener and communicator and constantly searches for ways to do better work. Sherif inspires with optimism—but his confidence is fact-based, which makes him a credible and reliable teammate.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 30,
    "name": "Hassan Hallouda, PMP",
    "headline": "Senior Project Manager at Dell Technologies",
    "relationship": "Worked with Sherif on different teams",
    "date": "2019-10-13",
    "quote": "Sherif is one of the few Resource Managers that made my life easier and the life of my PM colleagues easier. He understands the overall business, so in each request he knows the background and priority. You can rely on him on the most urgent requests as he always delivers.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 31,
    "name": "Israa Dabbour, PMP",
    "headline": "Project Management Office Manager at EMC, Dubai",
    "relationship": "Worked with Sherif on different teams",
    "date": "2019-10-07",
    "quote": "Sherif is one of the best resource managers I have worked with due to his dedicated attention to detail. His project management skills are the reason behind his successful engagements. I was always confident of the right outcome knowing he was managing the job.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 32,
    "name": "Lilian Hani Aziz",
    "headline": "Services Leader | Program Manager | Engineer",
    "relationship": "Worked with Sherif on different teams",
    "date": "2019-06-26",
    "quote": "Sherif has added a lot to making our PM lives easier. His organization skills as a Resource Manager are remarkable and we admire his persistence and follow-up on requests.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 33,
    "name": "Ahmed Selim",
    "headline": "Platforms Manager - IT Infrastructure",
    "relationship": "Worked with Sherif on the same team",
    "date": "2018-06-01",
    "quote": "Sherif is a strong caliber with unique skills; combining very good technical skills with excellent presentation and design skills. His strength lies in his ongoing ability to learn and being a fast learner. In the correct position and environment, I expect he will achieve huge success.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 34,
    "name": "Tamer El Kady",
    "headline": "FinTech | ITIL | PMP | Architect",
    "relationship": "Senior to Sherif (not direct manager)",
    "date": "2018-05-31",
    "quote": "Sherif is a talented young individual who makes rocket science look easy. He is a fast learner, adapts well to changes and different techniques, and his creativity is unorthodox and out of the box.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 35,
    "name": "Simon Hanna",
    "headline": "Assistant General Manager - T24 Application Support",
    "relationship": "Worked with Sherif on different teams",
    "date": "2018-05-30",
    "quote": "He is one of the most hard-working people that I have worked with. He thinks out of the box with new ideas. I would recommend him as I worked with him directly in many situations.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 36,
    "name": "Mohamed Zakaria",
    "headline": "Director, IT Infrastructure Management Head at CIB Egypt",
    "relationship": "Worked with Sherif on the same team",
    "date": "2018-05-30",
    "quote": "Sherif has great potential that will be beneficial for any organization he becomes a part of. His willingness to learn and stay updated with modern technologies are main features. His innovation and creativity stand out. I highly recommend Sherif for hiring.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 37,
    "name": "Sherif Korayem",
    "headline": "Vice President of Global Operations",
    "relationship": "Sherif reported to him (senior, not direct manager)",
    "date": "2016-03-08",
    "quote": "It's not every day that you come across someone like Sherif. He reported to me as a Workforce Specialist for almost a year, during which he proved to be organized, independent, and a tireless perfectionist, always ready to put in the energy to get the job done. One of the most reliable professionals you would meet.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 38,
    "name": "Mahitab M. Salem",
    "headline": "HR at The National Bank of Egypt",
    "relationship": "Worked with Sherif on different teams",
    "date": "2016-03-03",
    "quote": "\"Sherif is one of a kind; he has a really good eye for graphic design. He does very creative and efficient designs that meet requirements extremely well. I wish him continued success!\"",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 39,
    "name": "Shereen Nasser",
    "headline": "Customer Success / Project Management / Technology Services",
    "relationship": "Sherif’s client",
    "date": "2016-03-03",
    "quote": "Sherif is a very talented visual designer and great to work with. He is innovative and always looking for fresh ideas to exceed expectations. He is passionate and stays aware of new creative strategies. His designs are awesome.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 40,
    "name": "David Somers",
    "headline": "Former TSM Team Lead at IBM",
    "relationship": "Managed Sherif directly",
    "date": "2016-03-02",
    "quote": "Sherif has been a valuable member of the team, very diligent in his daily work, meticulous, and proactive in researching and solving customers' issues rather than passing them on. Customers have requested to work with Sherif based on prior engagements. It has been a pleasure having him on the team.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 41,
    "name": "Amr ElBakry",
    "headline": "Senior Solutions Engineer @ NetApp Saudi Arabia",
    "relationship": "Worked with Sherif on the same team",
    "date": "2016-03-02",
    "quote": "Sherif is a motivated, self-sufficient, extremely focused and hard-working professional. His innovative and persuasive nature enabled us to provide excellent work for our customers at IBM. He is one of the most creative people I have worked with—a true artist.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 42,
    "name": "Sandra Elias",
    "headline": "Customer Success Engineer at CyberArk (DACH) GmbH",
    "relationship": "Sherif was senior to her (not direct manager)",
    "date": "2016-03-01",
    "quote": "Sherif demonstrated true talent and leadership. He is attentive to details, meticulous in problem solving, punctual, responsible, and trustworthy. He breaks things down to their simplest form, making them easier to grasp. An excellent team player whose presence makes a difference.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 43,
    "name": "Ahmed Elaydi",
    "headline": "Project Manager | Customer Service Expert | AI Solutions Specialist",
    "relationship": "Worked with Sherif on the same team",
    "date": "2014-03-13",
    "quote": "Sherif is the epitome of everything you need in RTM & Mission Control—proactive, focused, intuitive and supportive. He showed a flair for ensuring every advisor did exactly what was required and when. He should be congratulated on ensuring we deliver what is required.",
    "source": "LinkedIn",
    "profile_url": ""
  },
  {
    "id": 44,
    "name": "Omar Rady",
    "headline": "MBA | Project Management | COPC implementation leader | Agile Practitioner",
    "relationship": "Senior to Sherif (not direct manager)",
    "date": "2014-03-12",
    "quote": "Mr. Kamal is one of the best calibers I've ever worked with. On a personal level, he created a great environment for the team. Professionally, he was a key player and a direct reason for a very successful expansion. I'd recommend him for even more challenging positions—he simply will not let his boss down.",
    "source": "LinkedIn",
    "profile_url": ""
  }
]